Xieliang0724/esp32c5_web_provision/sdkconfig.defaults
# ESP32-C5 目标
CONFIG_IDF_TARGET="esp32c5"

# 双频 Wi-Fi (2.4G + 5G)
CONFIG_SOC_WIFI_SUPPORT_5G=y

# 闪存大小：实测为 N8R4 (8MB)；如用 N4 (4MB) 板请改回 4MB
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

# 主任务栈
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# 日志级别
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# NVS 分区
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# HTTP Server
CONFIG_HTTPD_MAX_URI_HANDLERS=10

# 关闭功耗节省（配网期间保持响应）
CONFIG_PM_ENABLE=n

# mbedTLS：Modbus 帧很小，减小 TLS 收发缓冲节省 RAM
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=4096
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=4096
